In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
from pydataset import data

Paper by: Hadley Wickham

https://vita.had.co.nz/papers/tidy-data.pdf

### Data cleaning:

tidy data != clean data


- outlier checking  
- date parsing
- missing value imputation etc.
- <ins>data tidying: structuring datasets to facilitate analysis.</ins>

### Data semantics: tidy data

- Value: every value belongs to a variable and an observation.
- Variable: a variable contains all values that measure the same underlying attribute (like height, temperature, duration) across units.
- Observation: an observation contains all values measured on the same unit (like a person, or a day, or a race) across attributes.

####  datasets for lesson and exercises:

- https://classroom.google.com/c/MjU0ODgwOTM0NTgx/m/MzQzMzM2NzU0Mzc2/details

In [ ]:
# lets look at this data:
treatments = pd.read_csv('untidy-data/treatment.csv')
treatments

In [ ]:
#rename columns
treatments.columns = ['name', 'a', 'b', 'c']
treatments

What is an obervation here?  
variables?  
values?

In [ ]:
# restructure data using 'melt'

treatments = treatments.melt(id_vars=['name'], var_name='treatment', value_name='response')

In [ ]:
treatments

### Tidy data : 
- Each variable forms a column.
- Each observation forms a row.
- Each cell has a single value.
- data is tabular, i.e. made up of rows and columns

In [ ]:
# Examples of tidy-data?

#### General Ideas  
- If the units are the same, maybe they should be in the same column.
- If one column has measurements of different units, it should be spread out  
- Should you be able to groupby some of the columns? combine them  
- Can I pass this data to seaborn?  

- Can we ask interesting questions and answer them with a groupby? i.e. generally we don't want to be taking row or column averages.

### How to deal with 'messy' data


##### Reshaping data:  
  
- Wide data --> Long data format (Melt)  
- Long data --> Wide Data format (pivot_table, unstack)

#### 1. Messy data: Column headers are values, not variable names.

In [ ]:
df = pd.read_csv('untidy-data/pew.csv')

In [ ]:
# look at info
df.info()

In [ ]:
# look at the head
df.head()

In [ ]:
# Melt the data

#### pd.melt arguments
- id_vars = columns you want to keep (not melt)
- var_name = name of new column you created by melting columns
- value_name = column name for values

#### Another example: one variable stored across multiple columns

In [ ]:
billboard = pd.read_csv('untidy-data/billboard.csv', encoding= 'unicode_escape')

In [ ]:
# melt the data

In [ ]:
# what is the mean rating (across all weeks) of each track?

#### 2. Messy data: Multiple variables are stored in one column.

In [ ]:
df = pd.DataFrame({
    'name': ['Sally', 'Jane', 'Billy', 'Suzy'],
    'pet': ['dog: max', 'dog: buddy', 'cat: grizabella', 'hamster: fred']
})
df

#### Messy data: Variables are stored in both rows and columns

In [ ]:
weather = pd.read_csv('untidy-data/weather.csv')
weather.head()

#### pd.pivot_table arguments
- Index = columns you want to keep (not pivot)
- columns = column you want to pivot
- values = values we want to populate in the new columns
- aggfunct = how you want to aggregate the duplicate rows

## Mini Exercise:

- read in excel file named dem_score.xls
- convert the data in tidy format (hint: melt the data)
- convert the melted dataframe back in wide-format (hint: pivot the data)

In [4]:
score = pd.read_excel('untidy-data/dem_score.xlsx')

In [5]:
#look at the data
score.head()

     country  1952  1957  1962  1967  1972  1977  1982  1987  1992
0    Albania    -9    -9    -9    -9    -9    -9    -9    -9     5
1  Argentina    -9    -1    -1    -9    -9    -9    -8     8     7
2    Armenia    -9    -7    -7    -7    -7    -7    -7    -7     7
3  Australia    10    10    10    10    10    10    10    10    10
4    Austria    10    10    10    10    10    10    10    10    10

In [7]:
#takeaways:
# lots of years
# country
# columns need to be, country, year, score
score.shape

(96, 10)

In [10]:
score_melted = pd.melt(score, id_vars = 'country', var_name = 'year', value_name= 'score')

In [11]:
score_melted.head()

     country  year  score
0    Albania  1952     -9
1  Argentina  1952     -9
2    Armenia  1952     -9
3  Australia  1952     10
4    Austria  1952     10

In [14]:
# convert back to wide

score_pivoted = pd.pivot_table(score_melted, index='country', columns='year', values= 'score')
score_pivoted.head()

year       1952  1957  1962  1967  1972  1977  1982  1987  1992
country
Albania      -9    -9    -9    -9    -9    -9    -9    -9     5
Argentina    -9    -1    -1    -9    -9    -9    -8     8     7
Armenia      -9    -7    -7    -7    -7    -7    -7    -7     7
Australia    10    10    10    10    10    10    10    10    10
Austria      10    10    10    10    10    10    10    10    10

#### Bit more complex example

In [15]:
sales = pd.read_csv('untidy-data/sales.csv')

In [16]:
sales.head()

  Product  2016 Sales  2016 PPU  2017 Sales  2017 PPU  2018 Sales  2018 PPU
0       A         673         5         231         7         173         9
1       B         259         3         748         5         186         8
2       C         644         3         863         5         632         5
3       D         508         9         356        11         347        14